create_clock -name MY_CLK -period 11.6 {clk}
set_dont_touch_network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] clk]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]
compile
report_timing > ./Reports/report_timing_fck_4.txt
report_area > ./Reports/report_area_fck_4.txt
report_power > ./Reports/report_power_fck_4.txt



